Revit 2026 API

# PointCloudColorEncoding Enumeration

---

The color encodings supported by Revit point clouds.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PointCloudColorEncoding
```
```vb
Public Enumeration PointCloudColorEncoding
```
```cpp
public enum class PointCloudColorEncoding
```
```fsharp
type PointCloudColorEncoding
```

| Member name | Value | Description |
| --- | --- | --- |
| ABGR | 1 | The point cloud uses colors arranged in ABGR format (common in Windows). |
| ARGB | 0 | The point cloud uses colors arranged in ARGB format. |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace